In [ ]:
import pandas as pd
import numpy as np

In [96]:
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array, columns=['column1','column2','column3','column4'])
df.index = [0,1,'row2','row3',4]

In [97]:
df

      column1  column2  column3  column4
0           0        1        2        3
1           4        5        6        7
row2        8        9       10       11
row3       12       13       14       15
4          16       17       18       19

## <span style="color:Yellow"> Dataframe loc </span>

Access a group of rows and columns by label(s) or a boolean array.
- .loc[] is primarily label based, but may also be used with a boolean array.
- A single label, e.g. 5 or 'a', (note that 5 is interpreted as a label of the index, and never as an integer position along the index).

In [103]:
# Get row 1 all columns as panda series
series_1 = df.loc[1]
series_1

column1    4
column2    5
column3    6
column4    7
Name: 1, dtype: int64

In [106]:
# Get all rows and all columns as panda series
df.loc[:]

      column1  column2  column3  column4
0           0        1        2        3
1           4        5        6        7
row2        8        9       10       11
row3       12       13       14       15
4          16       17       18       19

In [105]:
# Get row2 all columns as panda series
series_row2 = df.loc['row2']
series_row2

column1     8
column2     9
column3    10
column4    11
Name: row2, dtype: int64

In [108]:
# Get all continous rows and all columns
df.loc[1:'row3']

      column1  column2  column3  column4
1           4        5        6        7
row2        8        9       10       11
row3       12       13       14       15

In [109]:
# Get Random rows of given index list.
index_list = [0,'row2',4]
df.loc[index_list]

      column1  column2  column3  column4
0           0        1        2        3
row2        8        9       10       11
4          16       17       18       19

In [111]:
# Boolean list with the same length as the row axis
boolean_list = [True,False,True,False,True]
random_df = df.loc[boolean_list]
random_df

      column1  column2  column3  column4
0           0        1        2        3
row2        8        9       10       11
4          16       17       18       19

 An alignable boolean Series. The index of the key will be aligned before masking.
 A callable function with one argument (the calling Series or DataFrame) and that returns valid output for indexing (one of the above)

In [45]:
# Return a single value by row label and Column Label. 
df.loc['row3','column2']

13

In [117]:
boolean_index_ps = pd.Series([False, False, False,True,True],
                             index=[0,1,4,'row2','row3'])
boolean_index_ps

0       False
1       False
4       False
row2     True
row3     True
dtype: bool

In [115]:
# Alignable boolean - Index Mapped panda series
boolean_index_ps = pd.Series([False, False, False,True,True],
                             index=[0,1,4,'row2','row3'])
df.loc[boolean_index_ps]

      column1  column2  column3  column4
row2        8        9       10       11
row3       12       13       14       15

In [51]:
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array, columns=['column1','column2','column3','column4'])

df.index = [0,1,'row2','row3',3]

In [119]:
df.loc[0:1,'column1']

0    0
1    4
Name: column1, dtype: int64

In [52]:
# set of rows and columns
df.loc[0:1,'column2':'column4']

   column2  column3  column4
0        1        2        3
1        5        6        7

In [53]:
# random rows and columns
df.loc[[0,1,3],'column2':'column4']

   column2  column3  column4
0        1        2        3
1        5        6        7
3       17       18       19

In [55]:
# list of row index and column index
df.loc[[0,1,3],['column2','column4']]

   column2  column4
0        1        3
1        5        7
3       17       19

In [59]:
# Get rows based on condition and all columns
df.loc[df['column2']> 5]

      column1  column2  column3  column4
row2        8        9       10       11
row3       12       13       14       15
3          16       17       18       19

In [60]:
# Get rows based on condition and selected columns
df.loc[df['column2']> 5,['column2','column3']]

      column2  column3
row2        9       10
row3       13       14
3          17       18

In [64]:
# pass as function , if you want to use x instead of a full dataframe name. 
df.loc[lambda x : x['column2'] > 6,['column2','column3']]

      column2  column3
row2        9       10
row3       13       14
3          17       18

In [67]:
# set a value for multiple columns baed on a given condition. 
df.loc[lambda x : x['column2'] > 6,['column2','column3']] = 20,30

In [68]:
df

      column1  column2  column3  column4
0           0        1        2        3
1           4        5        6        7
row2        8       20       30       11
row3       12       20       30       15
3          16       20       30       19

In [69]:
# set value for the entire row.
df.loc['row3'] = 10

In [70]:
df

      column1  column2  column3  column4
0           0        1        2        3
1           4        5        6        7
row2        8       20       30       11
row3       10       10       10       10
3          16       20       30       19

In [72]:
# Set value for an entire column
df.loc[:,'column3'] = 10

In [73]:
df

      column1  column2  column3  column4
0           0        1       10        3
1           4        5       10        7
row2        8       20       10       11
row3       10       10       10       10
3          16       20       10       19

In [78]:
# Set value for rows matching callable condition
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array, columns=['column1','column2','column3','column4'])

df.index = [0,1,'row2','row3',3]

In [79]:
df

      column1  column2  column3  column4
0           0        1        2        3
1           4        5        6        7
row2        8        9       10       11
row3       12       13       14       15
3          16       17       18       19

In [82]:
# set entire rows with a constant value based on a given condition.
df.loc[df['column2'] > 8] = 0

In [83]:
df

      column1  column2  column3  column4
0           0        1        2        3
1           4        5        6        7
row2        0        0        0        0
row3        0        0        0        0
3           0        0        0        0

## <span style="color:Yellow"> Dataframe MultiIndex loc </span>

In [85]:
tuples = [
   ('cobra', 'mark i'), ('cobra', 'mark ii'),
   ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
   ('viper', 'mark ii'), ('viper', 'mark iii')
]
index = pd.MultiIndex.from_tuples(tuples)
values = [[12, 2], [0, 4], [10, 20],
        [1, 4], [7, 1], [16, 36]]
df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [91]:
# row index range is given bas tuple
df.loc[('cobra','mark i'):('sidewinder','mark i')]

                    max_speed  shield
cobra      mark i          12       2
           mark ii          0       4
sidewinder mark i          10      20

In [95]:
df.loc[('cobra','mark i')]

max_speed    12
shield        2
Name: (cobra, mark i), dtype: int64